InformationRegisters/УчетныеЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>УчетныеЗаписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>id_user</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛогиОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЛогиОшибок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Даннные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияКофигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Процессор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОперативнаяПамять</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>user_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КритерииОшибок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КритерииОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КритерииОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКритичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Критическая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПроверяемыеСобытияОбработчикаОжидания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ПроверяемыеСобытияОбработчикаОжидания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автобэкап</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаЛогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСтатистики</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбщиеПроцедурыИФункцииСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	Возврат Константы[ИмяКонстанты].Получить();
КонецФункции

Функция ХешироватьпарольФункции(Пароль) Экспорт
	Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеширование.Добавить("екарныйбабай" + Пароль);
	Возврат НРег(СтрЗаменить(Хеширование.ХешСумма, " ", ""));
КонецФункции

Функция ПолучитьСтруктуруИзСтрокиJSON(ТекстJSON) Экспорт
	Возврат ПрочитатьСтроку(ТекстJSON);
КонецФункции

// Зарегестрировать учетную запись в системе.
// 
// Параметры:
//  Логин - Строка
//  Пароль - Строка
//  ID_User - Строка
// 
Процедура ЗарегестрироватьУчетнуюЗаписьВСистеме(Логин, Пароль, ID_User) Экспорт
	УспешнаяРегистрация = РегистрыСведений.УчетныеЗаписи.ЗаписатьНовуюУчетнуюЗапись(Логин, ID_User, Пароль);
	Если НЕ УспешнаяРегистрация Тогда
		ПопыткаРегистрации = 1;
		Пока НЕ УспешнаяРегистрация И ПопыткаРегистрации <= 5 Цикл
			ПопыткаРегистрации = ПопыткаРегистрации + 1;
			Пока ТранзакцияАктивна() Цикл
				ОтменитьТранзакцию();
			КонецЦикла;
			УспешнаяРегистрация = РегистрыСведений.УчетныеЗаписи.ЗаписатьНовуюУчетнуюЗапись(Логин, ID_User, Пароль);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ УспешнаяРегистрация Тогда
		ДиалогиСПользователямиСервер.ПоказатьСообщениеПользователю("Не удалось выполнить регистрацию пользователя... Повторите попытку позже.");
		ТекстЛога = "Выполнено 5 не удачных попыток регистрации пользователя в приложении!";
		ЛогированиеОшибокСервер.ЗаписатьОшибкуВЛоги(ТекстЛога,,, Перечисления.КритерииОшибок.Критическая);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьСтроку(ТекстJSON)
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	ЗаписьТекста = Новый ЗаписьТекста();
	ЗаписьТекста.Открыть(ИмяФайла);
	ЗаписьТекста.Записать(ТекстJSON);
	ЗаписьТекста.Закрыть();
	СтруктураОтвета = СформироватьСтруктуруИзJSON(ИмяФайла);
	УдалитьФайлы(ИмяФайла);
	Возврат  СтруктураОтвета;
КонецФункции

Функция СформироватьСтруктуруИзJSON(ИмяФайла)
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.ОткрытьФайл(ИмяФайла, "UTF-8");
	СтруктураОтвета = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	Возврат СтруктураОтвета;
КонецФункции
#КонецОбласти

#Область Справочники      

Функция ПроверитьНаличиеДубляНаименования(ИмяЭлемента, ИмяОбъекта, СпрСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Объект.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Магазины КАК Объект
	               |ГДЕ
	               |	Объект.Наименование = &Наименование
	               |	И Объект.Ссылка <> &Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Магазины КАК Объект", "Справочник." + ИмяОбъекта + " КАК Объект");
	Если ЗначениеЗаполнено(СпрСсылка)  Тогда
		Запрос.УстановитьПараметр("Ссылка", СпрСсылка);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Объект.Ссылка <> &Ссылка", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(ИмяЭлемента));	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции

#КонецОбласти

#Область НастройкиСистемы
Процедура УстановитьНастройки(Параметр, ЗначениеПараметра) Экспорт
	Справочники.ПараметрыСистемы.УстановитьНовоеЗначениеПараметраСистемы(Параметр, ЗначениеПараметра);
КонецПроцедуры

Функция ПолучитьНастройки(МассивПараметров) Экспорт
	 Возврат Справочники.ПараметрыСистемы.ПолучитьЗначенияПараметров(МассивПараметров)
 КонецФункции
 
 Функция ПолучитьУчетнуюЗапись() Экспорт
	Возврат РегистрыСведений.УчетныеЗаписи.ПолучитьУчетнуюЗапись();
КонецФункции
 #КонецОбласти
 
 #Область ФоновыеЗадания
 Функция ЗаданиеВыполнено(ПроверяемоеСобытие) Экспорт
	
	Результат = Новый Структура("НетДанных, Выполнено, ТекстСообщения", Истина, Ложь, "");
	
	Если ПроверяемоеСобытие = Перечисления.ПроверяемыеСобытияОбработчикаОжидания.Автобэкап Тогда
		УИД = Новый УникальныйИдентификатор(Константы.ФонУИД_Автобэкап.Получить());
	ИначеЕсли ПроверяемоеСобытие = Перечисления.ПроверяемыеСобытияОбработчикаОжидания.ОтправкаЛогов Тогда
		УИД = Новый УникальныйИдентификатор(Константы.ФонУИД_ОтправкаЛогов.Получить());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УИД) Тогда
		Результат.Выполнено = Истина;
		Результат.ТекстСообщения = "Не удалось выполнить!";
		Возврат Результат;
	КонецЕсли;
	
	//Находим фоновое задание по идентификатору 
	ФонЗад = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(УИД);
	
	//Проверяем статус
	Если ФонЗад <> Неопределено Тогда
		Результат.НетДанных = Ложь;
		Если ФонЗад.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Результат.Выполнено = Истина;
			Результат.ТекстСообщения = "Выполнен успешно";
		ИначеЕсли ФонЗад.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Результат.Выполнено = Истина;
			Результат.ТекстСообщения = "Не удалось выполнить!";
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ФонЗад.ИнформацияОбОшибке);
			РегистрыСведений.ЛогиОшибок.ЗаписатьОшибкуВЛоги(ТекстОшибки);
		ИначеЕсли ФонЗад.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			Результат.Выполнено = Истина;
			Результат.ТекстСообщения = "Не удалось выполнить!";
			
			
			Если ПроверяемоеСобытие = Перечисления.ПроверяемыеСобытияОбработчикаОжидания.Автобэкап Тогда
				ИмяФона = "Автобэкап";
			ИначеЕсли ПроверяемоеСобытие = Перечисления.ПроверяемыеСобытияОбработчикаОжидания.ОтправкаЛогов Тогда
				ИмяФона = "Отправка логов";
			ИначеЕсли ПроверяемоеСобытие = Перечисления.ПроверяемыеСобытияОбработчикаОжидания.ОтправкаСтатистики Тогда 
				ИмяФона = "Отправка статистики";
			КонецЕсли;
			
			РегистрыСведений.ЛогиОшибок.ЗаписатьОшибкуВЛоги("Отмена фонового задания: " + ИмяФона); 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции                       
#КонецОбласти
